export default {
  // bullet
  w1: {
    type: 'hitscan',
    impulseMagnitude: 500, // сила импульса (кг*м/с)
    damage: 40, // урон от одного попадания
    range: 1500, // максимальная дальность выстрела (в игровых юнитах)
    fireRate: 0, // кулдаун между выстрелами (0 - отсутствует)
    spread: 0, // разброс в радианах (0 для идеальной точности)
    consumption: 1, // расход патронов за один выстрел
    cameraShake: {
      intensity: 5, // сила тряски (в пикселях)
      duration: 150, // продолжительность (в миллисекундах)
    },
  },

  // bomb
  w2: {
    type: 'explosive',
    constructor: 'Bomb',
    time: 1000,
    shotOutcomeId: 'w2e', // id конструктора для детонации бомбы
    size: 13, // соотношение сторон 1:1
    fireRate: 0.5, // кулдаун (0 - отсутствует)
    damage: 70, // урон в эпицентре
    radius: 80, // радиус взрыва
    impulseMagnitude: 20000000, // сила импульса
    cameraShake: {
      intensity: 30, // сила тряски (в пикселях)
      duration: 400, // продолжительность (в миллисекундах)
    },
  },
};
